In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame()

In [4]:
df['fruit'] = ['apple','banana','orange']
df['number'] = [1,2,3]
df['grade'] = ['a','b','c']

In [5]:
df

    fruit  number grade
0   apple       1     a
1  banana       2     b
2  orange       3     c

In [6]:
df.drop('number', axis=1)

    fruit grade
0   apple     a
1  banana     b
2  orange     c